app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT * FROM `cards` WHERE (`cards`.user_id = 1)

  def show
    @card = Card.find(params[:id])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 1)

  def edit
    @card = Card.find(params[:id])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 4)

  def create
    @card = Card.new(params[:card])

    respond_to do |format|
      if @card.save
---
INSERT INTO `cards` (`name`, `created_at`, `card_type`, `updated_at`, `user_id`, `image`) VALUES('Everybody drinks!', '2010-04-14 09:41:48', 'special', '2010-04-14 09:41:48', NULL, NULL)

  def update
    @card = Card.find(params[:id])

    respond_to do |format|
      if @card.update_attributes(params[:card])
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 4)
UPDATE `cards` SET `updated_at` = '2010-04-10 10:01:13', `name` = 'Ross drinks', `card_type` = 'special' WHERE `id` = 19

  def destroy
    @card = Card.find(params[:id])
    @card.destroy
---
SELECT * FROM `cards` WHERE (`cards`.`id` = 4)
DELETE FROM `cards` WHERE `id` = 4