app/controllers/games_controller.rb

SELECT * FROM `games` WHERE (`games`.user_id = 1) ORDER BY created_at desc
---
  def index
    @games = current_user.games.all(:order => "created_at desc")

SELECT * FROM `games` WHERE (`games`.`id` = 14 AND (`games`.user_id = 1))
SELECT * FROM `cards`
UPDATE `games` SET `updated_at` = '2010-04-10 08:42:38', `card_id` = 2 WHERE `id` = 2
---
  def show
    @game = current_user.games.find(params[:id])
    if(@game.card.nil?)
      @card = Card.all.choice
      @game.card = @card
      @game.save

SELECT * FROM `games` WHERE (`games`.`id` = 14 AND (`games`.user_id = 1))
---
  def edit
    @game = current_user.games.find(params[:id])

INSERT INTO `games` (`name`, `max_rounds`, `created_at`, `updated_at`, `card_id`, `user_id`, `current_round`, `phase`, `round_count`) VALUES('Test Game', 3, '2010-04-13 08:45:57', '2010-04-13 08:45:57', NULL, 1, 1, 'take', 0)
---
  def create
    @game = current_user.games.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT * FROM `games` WHERE (`games`.`id` = 5)
UPDATE `games` SET `updated_at` = '2010-04-10 10:42:39', `max_rounds` = 2 WHERE `id` = 9
---
  def update
    @game = current_user.games.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])

SELECT * FROM `games` WHERE (`games`.`id` = 1)
DELETE FROM `games` WHERE `id` = 1
---
  def destroy
    @game = current_user.games.find(params[:id])
    @game.destroy

SELECT * FROM `games` WHERE (`games`.`id` = 14 AND (`games`.user_id = 1))
---
  def next_round
    @game = current_user.games.find(params[:id])